ujagaga/esp32_nixi_lcd_clock/http_server.cpp
/*
 *  Author: Rada Berar
 *  email: ujagaga@gmail.com
 *
 *  HTTP server which generates the web browser pages. Its whole job is WiFi
 *  reconfiguration: scan/pick a station AP + password, save. Everything else
 *  runs standalone once connected.
 */

#include <WebServer.h>
#include "wifi_connection.h"
#include "config.h"
#include "esp32_nixi_lcd_clock.h"
#include "weather.h"
#include "lcd_display.h"
#include "http_ui.h"

// <input type='color'> <-> RGB565 conversions, for the clock digit color field.
static uint16_t hexToRGB565(String hex){
  if(hex.length() && hex[0] == '#') hex = hex.substring(1);
  long v = strtol(hex.c_str(), nullptr, 16);
  uint8_t r = (v >> 16) & 0xFF, g = (v >> 8) & 0xFF, b = v & 0xFF;
  return ((r & 0xF8) << 8) | ((g & 0xFC) << 3) | (b >> 3);
}

static String rgb565ToHex(uint16_t c){
  uint8_t r = ((c >> 11) & 0x1F) * 255 / 31;
  uint8_t g = ((c >> 5) & 0x3F) * 255 / 63;
  uint8_t b = (c & 0x1F) * 255 / 31;
  char buf[8];
  snprintf(buf, sizeof(buf), "#%02X%02X%02X", r, g, b);
  return String(buf);
}

// --- Web server object ---
WebServer* webServer = nullptr;

// --- Page handlers ---
void showStartPage() {
  WIFIC_startScan();   // kick off the scan; page JS polls /aplist ~10s later

  String response = FPSTR(HTML_BEGIN);
  response += FPSTR(CONFIG_HTML_0);
  if(WIFIC_stationConnected()){
    response += "<p>Connected to <b>" + WIFIC_getStSSID() + "</b></p>";
  }else{
    response += "<p>Not connected to a WiFi network yet.</p>";
  }
  response += FPSTR(CONFIG_HTML_1);
  response += FPSTR(CONFIG_FORM_HEAD);

  response += "<input id='s' name='s' length=32 value='" + WIFIC_getStSSID() +
              "' placeholder='SSID (Leave blank for AP mode)'><br>";
  response += "<input id='p' name='p' length=32 placeholder='Password'><br>";

  int selectedLoc = WEATHER_getLocationIndex();
  int customLocIndex = WEATHER_getLocationCount() - 1;
  response += "<label for='loc'>Weather location</label><br>";
  response += "<select id='loc' name='loc' onchange=\"document.getElementById('gps').style.display=(this.value=='"
              + String(customLocIndex) + "')?'block':'none';\">";
  for(int i = 0; i < WEATHER_getLocationCount(); i++){
    response += "<option value='" + String(i) + "'";
    if(i == selectedLoc){
      response += " selected";
    }
    response += ">" + WEATHER_getLocationName(i) + "</option>";
  }
  response += "</select><br>";
  response += "<div id='gps' style='display:" + String(selectedLoc == customLocIndex ? "block" : "none") + "'>";
  response += "<input id='lat' name='lat' value='" + String(WEATHER_getCustomLat(), 4) + "' placeholder='Latitude'><br>";
  response += "<input id='lon' name='lon' value='" + String(WEATHER_getCustomLon(), 4) + "' placeholder='Longitude'><br>";
  response += "</div>";

  response += "<label for='clockColor'>Clock digit color</label><br>";
  response += "<input type='color' id='clockColor' name='clockColor' value='" +
              rgb565ToHex(LCD_getClockColor()) + "'><br>";

  response += FPSTR(CONFIG_FORM_TAIL);
  response += FPSTR(HTML_END);
  webServer->send(200, "text/html", response);
}

static void showNotFound(void){
  webServer->send(404, "text/html; charset=iso-8859-1","<html><head> <title>404 Not Found</title></head><body><h1>Not Found</h1></body></html>");
}

static void showStatusPage(bool goToHome = false) {
  String response = FPSTR(HTML_BEGIN);
  response += "<h1>Connection Status</h1><p>";
  response += MAIN_getStatusMsg() + "</p>";
  if(goToHome){
    response += FPSTR(REDIRECT_HTML);
  }
  response += FPSTR(HTML_END);
  webServer->send(200, "text/html", response);
}

static void saveWiFi(void){
  String ssid = webServer->arg("s");
  String pass = webServer->arg("p");
  int loc = webServer->arg("loc").toInt();

  if((ssid.length() > 63) || (pass.length() > 63)){
      MAIN_setStatusMsg("Sorry, this module can only remember SSID and a PASSWORD up to 63 bytes long.");
      showStatusPage(true);
      return;
  }

  if(loc == WEATHER_getLocationCount() - 1){
    WEATHER_setCustomLocation(webServer->arg("lat").toFloat(), webServer->arg("lon").toFloat());
  }else{
    WEATHER_setLocationIndex(loc);
  }

  LCD_setClockColor(hexToRGB565(webServer->arg("clockColor")));

  String st_ssid = WIFIC_getStSSID();
  String st_pass = WIFIC_getStPass();

  if(st_ssid.equals(ssid) && st_pass.equals(pass)){
      MAIN_setStatusMsg("All parameters are already set as requested.");
      showStatusPage(true);
      return;
  }

  WIFIC_setStSSID(ssid);
  WIFIC_setStPass(pass);

  String http_statusMessage;

  if(ssid.length() > 3){
    http_statusMessage = "Saving settings and connecting to SSID: " + ssid;
  }else{
    http_statusMessage = "No SSID selected...";
  }

  MAIN_setStatusMsg(http_statusMessage);
  showStatusPage();

  WIFIC_stationMode();   // explicit save: connect now, scanning is done for this visit
}

static void apList(void){
  webServer->send(200, "text/plain", WIFIC_getApList());
}

// --- Public functions ---
void HTTP_SERVER_process(void){
  webServer->handleClient();
}

void HTTP_SERVER_init(void){
  if (webServer != nullptr) {
    delete webServer; // Clean up old one
  }
  webServer = new WebServer(80);

  webServer->on("/", HTTP_GET, showStartPage);
  webServer->on("/favicon.ico", HTTP_GET, showNotFound);
  webServer->on("/wifisave", HTTP_GET, saveWiFi);
  webServer->on("/aplist", HTTP_GET, apList);
  webServer->onNotFound(showStartPage);

  webServer->begin();
}
